In [1]:
import seaborn as sns
import pandas as pd
import numpy as np

In [2]:
bfe_processed_df = pd.read_csv("./data/hurdat_bfe_joined.csv")
bfe_processed_df

,atcf_code,storm_name,year,month,day,hour,minute,record_id,system_status,latitude,...,000hI01,012hI01,024hI01,036hI01,048hI01,072hI01,096hI01,120hI01,144hI01,168hI01
0,AL021975,AMY,1975,6,28,6,0,NaN,TD,32.4,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,AL021975,AMY,1975,6,28,12,0,NaN,TD,33.3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,AL021975,AMY,1975,6,28,18,0,NaN,TD,34.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,AL021975,AMY,1975,6,29,0,0,NaN,TS,34.4,...,-9999.0,-9999.0,-9999.0,-9999.0,-9999.0,-9999.0,-9999.0,-9999.0,-9999.0,-9999.0
4,AL021975,AMY,1975,6,29,6,0,NaN,TS,34.0,...,-9999.0,-9999.0,-9999.0,-9999.0,-9999.0,-9999.0,-9999.0,-9999.0,-9999.0,-9999.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
11180,AL162018,OSCAR,2018,10,31,12,0,NaN,HU,35.4,...,-5.0,-9999.0,-9999.0,-9999.0,-9999.0,-9999.0,-9999.0,-9999.0,-9999.0,-9999.0
11181,AL162018,OSCAR,2018,10,31,18,0,NaN,EX,38.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11182,AL162018,OSCAR,2018,11,1,0,0,NaN,EX,40.7,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11183,AL162018,OSCAR,2018,11,1,6,0,NaN,EX,43.4,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11184,AL162018,OSCAR,2018,11,1,12,0,NaN,EX,46.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [30]:
cols_keep = ['atcf_code','storm_name','month','day','hour','minute']
cols_keep += [c for c in bfe_processed_df if c.endswith("T01")]
error_columns = [c for c in bfe_processed_df if c.endswith("T01")]
bfe_processed_df = bfe_processed_df[cols_keep]
bfe_processed_df = bfe_processed_df.replace(-9999.0, np.NaN)
bfe_processed_df.head(10)

,atcf_code,storm_name,month,day,hour,minute,000hT01,012hT01,024hT01,036hT01,048hT01,072hT01,096hT01,120hT01,144hT01,168hT01
0,AL021975,AMY,6,28,6,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,AL021975,AMY,6,28,12,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,AL021975,AMY,6,28,18,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,AL021975,AMY,6,29,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,AL021975,AMY,6,29,6,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,AL021975,AMY,6,29,12,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,AL021975,AMY,6,29,18,0,10.0,117.8,159.6,NaN,170.1,212.2,NaN,NaN,NaN,NaN
7,AL021975,AMY,6,30,0,0,7.8,54.3,143.2,NaN,143.8,161.6,NaN,NaN,NaN,NaN
8,AL021975,AMY,6,30,6,0,7.7,7.7,56.0,NaN,178.3,356.4,NaN,NaN,NaN,NaN
9,AL021975,AMY,6,30,12,0,6.0,45.1,105.7,NaN,190.0,251.9,NaN,NaN,NaN,NaN

In [45]:
forcast_errors = bfe_processed_df[error_columns]
forcast_error_times = [int(x[:3]) for x in error_columns][:-2]
forcast_error_average = forcast_errors.mean().tolist()[:-2]
forcast_error_average

[9.947448716627221,
 35.9376353591159,
 65.27252017085915,
 83.7014018691586,
 123.216520406742,
 189.22815847645066,
 174.35930186433913,
 229.30592885375447]

In [ ]:
sns.lineplot(x=forcast_error_times, y=forcast_error_average)